SelfControl/src/Catalogs/СессииТестирования/СессииТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СессииТестирования</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборВопросов</name>
    <type>
      <types>CatalogRef.ОтборыВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Стартована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПросмотра</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОтвета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПояснениеПросмотрено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВерныйОтвет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SelfControl/src/Catalogs/СессииТестирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;		
	КонецЕсли; 
	
	СгенерироватьНаименование();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ЭтотОбъект.ДатаНачала = ТекущаяДатаСеанса();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборВопросов) Тогда
		ЗаполнитьВопросы();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура СгенерироватьНаименование()
	НаименованиеОтбора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ОтборВопросов, "Наименование");
	
	Если ЭтотОбъект.Завершена Тогда
		ШаблонНаименования = "%1 (%2 - %3), %4";
		
		ВремяТестированияСек = ЭтотОбъект.ДатаОкончания - ЭтотОбъект.ДатаНачала;
		ВремяТестирования = ОбщегоНазначения.ПредставлениеВремени(ВремяТестированияСек);
		
		ЭтотОбъект.Наименование  = СтрШаблон(ШаблонНаименования
			, НаименованиеОтбора
			, ОбщегоНазначенияКлиентСервер.ФДата(ЭтотОбъект.ДатаНачала)
			, ОбщегоНазначенияКлиентСервер.ФДата(ЭтотОбъект.ДатаОкончания)
			, ВремяТестирования);
	Иначе
		ШаблонНаименования = "%1: %2";		
		ЭтотОбъект.Наименование = СтрШаблон(ШаблонНаименования
			, НаименованиеОтбора
			, ЭтотОбъект.ДатаНачала);
			
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьВопросы()
	СписокВопросовОтбора = Справочники.ОтборыВопросов.СписокВопросовОтбора(ЭтотОбъект.ОтборВопросов);
	ПеремешиватьВопросы = Константы.ПеремешиватьВопросы.Получить();	
	Если ПеремешиватьВопросы Тогда
		СписокВопросовВРезультат = ОбщегоНазначения.ПеремешатьЗначения(СписокВопросовОтбора);				
	Иначе
		СписокВопросовВРезультат = СписокВопросовОтбора;						
	КонецЕсли;	
	
	ЭтотОбъект.Вопросы.Очистить();
	Для каждого Вопрос Из СписокВопросовВРезультат Цикл
		ЭтотОбъект.Вопросы.Добавить().Вопрос = Вопрос;		
	КонецЦикла; 
	
КонецПроцедуры
 
#КонецОбласти 

#КонецЕсли
